app/controllers/messages_controller.rb

  def index
    @messages = Message.where(user_id: current_user.id)
---
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = $1  [["user_id", 2]]

  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save
---
INSERT INTO "messages" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "aaa"], ["content", "azaz"], ["created_at", "2015-06-17 13:42:48.242333"], ["updated_at", "2015-06-17 13:42:48.242333"]]

  def askModif

    @rage = Rage.find(params[:id])

    @message = Message.create(:title => "Rejected : " + @rage.title, :content => params[:content], :user_id => @rage.user_id)
    @message.save
---
SELECT  "rages".* FROM "rages" WHERE "rages"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "messages" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Rejected : aziz"], ["content", "Change le titre plz"], ["user_id", 2], ["created_at", "2015-06-19 12:14:49.636647"], ["updated_at", "2015-06-19 12:14:49.636647"]]
UPDATE "rages" SET "state" = $1, "updated_at" = $2 WHERE "rages"."id" = $3  [["state", "waitingAmelioration"], ["updated_at", "2015-06-19 12:12:58.816691"], ["id", 2]]

  def rejectedRage

    @rage = Rage.find(params[:id])

    @message = Message.create(:title => "Rejected : " + @rage.title, :content => "Votre réclamation a été refusé car elle ne respectait pas les conditions d'utilisations, vous pouvez la soummetre à nouveau", :user_id => @rage.user_id)
    @message.save
---
SELECT  "rages".* FROM "rages" WHERE "rages"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "messages" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "rejectedtitle"], ["content", "rejectedContent"], ["user_id", 2], ["created_at", "2015-06-17 14:15:39.272314"], ["updated_at", "2015-06-17 14:15:39.272314"]]
UPDATE "rages" SET "state" = $1, "updated_at" = $2 WHERE "rages"."id" = $3  [["state", "rejected"], ["updated_at", "2015-06-17 14:10:22.208723"], ["id", 2]]