app/controllers/myrages_controller.rb

SELECT "rages".* FROM "rages" WHERE "rages"."user_id" = $1  [["user_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT "rages".* FROM "rages"
---
  def index
    if current_user
      @rages = Rage.where(user_id: current_user.id)
      @user = User.find(current_user.id)
      if @rages.nil?
       @rages = Array.new
      end
    else
      @rages = Rage.all