app/controllers/participations_controller.rb

SELECT "participations".* FROM "participations" WHERE "participations"."user_id" = $1  [["user_id", 2]]
SELECT  "participations".* FROM "participations" WHERE "participations"."user_id" = $1  ORDER BY "participations"."id" ASC LIMIT 1000  [["user_id", 2]]
SELECT  "rages".* FROM "rages" WHERE "rages"."id" = $1 LIMIT 1  [["id", 1]]
---
  def index
    if current_user
      participationList = Participation.where(user_id: current_user.id)
      @rageList = Array.new()
      participationList.find_each do |participation|
         @rageList << Rage.find(participation.rage_id)

INSERT INTO "participations" ("user_id", "rage_id", "isAuthor", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["rage_id", 13], ["isAuthor", "f"], ["created_at", "2015-06-17 09:13:15.320141"], ["updated_at", "2015-06-17 09:13:15.320141"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
  def create
    @participation = Participation.new
    @participation.user_id = current_user.id
    @participation.rage_id = params[:rage_id]
    @participation.isAuthor = false
    @participation.save

    respond_to do |format|
      if @participation.save

        participationList = Participation.where(user_id: @participation.user_id)
        @rageList = Array.new()
        participationList.find_each do |participation|