app/controllers/rages_controller.rb

  def index
    if current_user
      @user = User.find(current_user.id)
      @participations = Participation.where(user_id: current_user.id)
      if @user.admin?
        @admin = true
      end
    end
    @rages = Rage.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT "participations".* FROM "participations" WHERE "participations"."user_id" = $1  [["user_id", 1]]
SELECT  `rages`.* FROM `rages` WHERE `id`.`rage_id` = 1 LIMIT 1

  def show
    @rage = Rage.find(params[:id])
    @proof_attachments = @rage.proof_attachments.all
---
SELECT  "rages".* FROM "rages" WHERE "rages"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "proof_attachments".* FROM "proof_attachments" WHERE "proof_attachments"."rage_id" = $1  [["rage_id", 1]]

  def create
    @rage = Rage.new(rage_params)
    @rage.user_id = current_user.id
    @rage.state = 'draft'
    respond_to do |format|
      if @rage.save
---
INSERT INTO "rages" ("title", "description", "picture", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Mon cul"], ["description", "blabla"], ["picture", "test-201.gif"], ["user_id", 1], ["created_at", "2015-06-16 11:07:34.390328"], ["updated_at", "2015-06-16 11:07:34.390328"]]

  def destroy
    @rage.destroy
    participationList = Participation.where(rage_id: @rage.id)
    participationList.find_each do |participation|
      participation.destroy
---
DELETE FROM "rages" WHERE "rages"."id" = $1  [["id", 6]]
SELECT  "participations".* FROM "participations" WHERE "participations"."rage_id" = $1  ORDER BY "participations"."id" ASC LIMIT 1000  [["rage_id", 12]]
DELETE FROM "participations" WHERE "participations"."id" = $1  [["id", 1]]

  def publish

    @rage = Rage.find(params[:id])

    if (current_user.id != @rage.user_id && !current_user.admin)

      respond_to do |format|
        format.html { redirect_to rages_url, notice: 'Unbale to publish rage. '}
        format.json { head :no_content }
      end

      return

    end

    if (@rage.state == 'draft' || @rage.state =='republished' )
      @rage.update_attribute(:state, 'published')
---
SELECT  "rages".* FROM "rages" WHERE "rages"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "rages" SET "state" = $1, "updated_at" = $2 WHERE "rages"."id" = $3  [["state", "published"], ["updated_at", "2015-06-17 13:53:37.913243"], ["id", 2]]

    def set_rage
      @rage = Rage.find(params[:id])
---
SELECT  "rages".* FROM "rages" WHERE "rages"."id" = $1 LIMIT 1  [["id", 6]]